# PracticeCase_Python
Data Fellowship by IYKRA

Name: Alifia Cesarina Harmadi

# Question 1

In [1]:
import sqlite3

def main():
    connection = sqlite3.connect('data.db')

    cursor = connection.cursor()

    data = """CREATE TABLE IF NOT EXISTS
    transactions(id INTEGER,
                user_id INTEGER,
                insert_time TIMESTAMP,
                tx_amount FLOAT, 
                tx_type TEXT,
                status TEXT)"""

    cursor.execute(data)

    cursor.execute("INSERT INTO transactions VALUES (1,1,7.30,20, 'buy','open')")
    cursor.execute("INSERT INTO transactions VALUES (2,3,7.45,20, 'buy','close')")
    cursor.execute("INSERT INTO transactions VALUES (3,2,8.10,20, 'sell','open')")
    cursor.execute("INSERT INTO transactions VALUES (4,1,8.21,20, 'sell','open')")
    cursor.execute("INSERT INTO transactions VALUES (5,1,8.47,20, 'buy','close')")
    cursor.execute("INSERT INTO transactions VALUES (6,2,9.03,20, 'buy','open')")
    cursor.execute("INSERT INTO transactions VALUES (7,4,9.15,20, 'sell','close')")
    cursor.execute("INSERT INTO transactions VALUES (8,3,9.27,20, 'buy','open')")

    cursor.execute("""SELECT t1.* 
                      FROM transactions t1
                      WHERE t1.insert_time = (SELECT MAX(t2.insert_time)
                      FROM transactions t2
                      WHERE t2.user_id = t1.user_id) """   )

    for result in cursor.fetchall():
        print(result)

if __name__ == "__main__":
    main()

(5, 1, 8.47, 20.0, 'buy', 'close')
(6, 2, 9.03, 20.0, 'buy', 'open')
(7, 4, 9.15, 20.0, 'sell', 'close')
(8, 3, 9.27, 20.0, 'buy', 'open')

# Question 2

In [2]:
import sqlite3

def main():
    connection = sqlite3.connect('data.db')

    cursor = connection.cursor()

    data = """CREATE TABLE IF NOT EXISTS
    datasetB(Date TIMESTAMP, Sales INTEGER)"""

    cursor.execute(data)

    cursor.execute("INSERT INTO datasetB VALUES ('01/01/21',100)")
    cursor.execute("INSERT INTO datasetB VALUES ('02/01/21',34)")
    cursor.execute("INSERT INTO datasetB VALUES ('02/01/21',123)")
    cursor.execute("INSERT INTO datasetB VALUES ('02/01/21',132)")
    cursor.execute("INSERT INTO datasetB VALUES ('03/01/21',145)")
    cursor.execute("INSERT INTO datasetB VALUES ('03/01/21',24)")
    cursor.execute("INSERT INTO datasetB VALUES ('04/01/21',541)")
    cursor.execute("INSERT INTO datasetB VALUES ('04/01/21',636)")
    cursor.execute("INSERT INTO datasetB VALUES ('05/01/21',322)")
    cursor.execute("INSERT INTO datasetB VALUES ('06/01/21',242)")
    cursor.execute("INSERT INTO datasetB VALUES ('07/01/21',22)")
    cursor.execute("INSERT INTO datasetB VALUES ('08/01/21',46)")

    cursor.execute("SELECT DISTINCT(Date), SUM(Sales) OVER(PARTITION BY Date) FROM datasetB")

    for result in cursor.fetchall():
        print(result)

if __name__ == "__main__":
    main()

('01/01/21', 100)
('02/01/21', 289)
('03/01/21', 169)
('04/01/21', 1177)
('05/01/21', 322)
('06/01/21', 242)
('07/01/21', 22)
('08/01/21', 46)

# Question 3

### write and load a JSON file

In [3]:
# Python program to convert
# JSON file to CSV

import pandas as pd
import json
import csv

data = [
          {
              "user": {
                  "id": 1,
                  "name": "agus",
                  "email": "agus@example.com"
              },
              "txs": [
                  {
                      "id": 1,
                      "tx_date": "2020-01-01",
                      "tx_amount": 10,
                      "tx_type": "buy"
                  },
                  {
                      "id": 3,
                      "tx_date": "2020-02-01",
                      "tx_amount": 10,
                      "tx_type": "buy"
                  },
                  {
                      "id": 5,
                      "tx_date": "2020-03-01",
                      "tx_amount": 20,
                      "tx_type": "sell"
                  }
              ]
          },
          {
              "user": {
                  "id": 2,
                  "name": "asep",
                  "email": "asep@example.com"
              },
              "txs": [
                  {
                      "id": 2,
                      "tx_date": "2020-01-01",
                      "tx_amount": 10,
                      "tx_type": "sell"
                  },
                  {
                      "id": 4,
                      "tx_date": "2020-02-01",
                      "tx_amount": 10,
                      "tx_type": "sell"
                  },
                  {
                      "id": 6,
                      "tx_date": "2020-03-01",
                      "tx_amount": 20,
                      "tx_type": "buy"
                  }
              ]
          }
       ]
 
with open('data.json', 'w') as files:
    json.dump(data,files)
 
# Opening JSON file and loading the data
# into the variable data
with open('data.json') as f:
    data = json.load(f)

In [4]:
# Transform JSON file into Dataframe
data = pd.json_normalize(data, 'txs', [['user','id'], ['user','name'], ['user','email']])
data.head()

   id     tx_date  tx_amount tx_type user.id user.name        user.email
0   1  2020-01-01         10     buy       1      agus  agus@example.com
1   3  2020-02-01         10     buy       1      agus  agus@example.com
2   5  2020-03-01         20    sell       1      agus  agus@example.com
3   2  2020-01-01         10    sell       2      asep  asep@example.com
4   4  2020-02-01         10    sell       2      asep  asep@example.com

### convert the JSON file into three CSV files

In [5]:
CSV_1 = data[['user.id','id']]
CSV_1.to_csv('CSV_1.csv', header= ['user_id', 'tx_id'],index= False)

In [6]:
CSV_2 = data[['user.id','user.name', 'user.email']].drop_duplicates().reset_index(drop=True)
CSV_2.to_csv('CSV_2.csv', header= ['id', 'name', 'email'], index= False)

In [7]:
CSV_3 = data[['id', 'tx_date', 'tx_amount', 'tx_type']].sort_values('tx_date')
CSV_3.to_csv('CSV_3.csv', index = False)